app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "priority", "completed_at", "due_date", "due_time", "created_at", "updated_at", "list_id") VALUES ('New Task', NULL, NULL, NULL, NULL, NULL, '2026-01-19 01:28:53.401305', '2026-01-19 01:28:53.401305', 4) RETURNING "id"
---
  def create
    @task = @list.tasks.build(title: "Nova Tarefa")
    @task.save